# Геометрической прогрессией называется последовательность чисел b1, b2.. bq, 
# каждое из которых, начиная с b2, получается из предыдущего умножением на одно и то же постоянное число q (знаменатель прогрессии).
# Если известен первый член прогрессии и ее знаменатель, то n-ый член геометрической прогрессии находится по формуле
# bn = b1 * q**n-1

def bn(b: int, q: int, n: int) -> int:
    result = b * (q**(n-1))
    return(result)

b = int(input())
q = int(input())
n = int(input())

print(bn(b, q, n))