# Китайский гороскоп назначает животным годы в 12-летнем цикле.
# Напишите программу, которая считывает год и отображает название связанного с ним животного.
# https://stepik.org/lesson/415553/step/6?unit=405082

years_dictionary = {2000: 'Дракон',
                    2001: 'Змея',
                    2002: 'Лошадь',
                    2003: 'Овца',
                    2004: 'Обезьяна',
                    2005: 'Петух',
                    2006: 'Собака',
                    2007: 'Свинья',
                    2008: 'Крыса',
                    2009: 'Бык',
                    2010: 'Тигр',
                    2011: 'Заяц'}
animals_list = []
count = 0
for y, a in years_dictionary:
    while count < 12:
        starting_year = y % 12
        if starting_year == 0:
            animals_list.append(a)
            count += 1




print(2004 % 12)
