my_list = ['A', 'B', 'C', 'D', 'E', 'F']
my_list.remove(my_list[-2])
print(my_list)

# max(), min() - сравнивают по элементам списка. Для вложенных списков - сравнивают вложенные списки внутри одного списка
# len()
# append() - добавляет новый элемент в конец списка;
# extend() - расширяет один список другим списком;
# insert() - вставляет значение в список в заданной позиции;
# index() - возвращает индекс первого элемента, значение которого равняется переданному в метод значению;
# remove() - удаляет первый элемент, значение которого равняется переданному в метод значению;
# pop() - удаляет элемент по указанному индексу и возвращает его;
# count() - возвращает количество элементов в списке, значения которых равны переданному в метод значению;
# reverse() - инвертирует порядок следования значений в списке, то есть меняет его на противоположный;
# copy() - создает поверхностную копию списка.;
# clear() - удаляет все элементы из списка;
# оператор del позволяет удалять элементы списка по определенному индексу
# split() разбивает строку на слова по разделителю
# join() собирает строку из элементов списка, используя в качестве разделителя строку, к которой применяется метод.
